# BorderTopLineStyle Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
TableCellStyle..::..BorderTopLineStyle Property
TableCellStyle Class See Also
---
The element id (GraphicsStyle element) for the top line of the cell border.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public ElementId BorderTopLineStyle { get; set; }
```

Visual Basic
---
```text
Public Property BorderTopLineStyle As ElementId
	Get
	Set
```

Visual C++
---
```text
public:
property ElementId^ BorderTopLineStyle {
	ElementId^ get ();
	void set (ElementId^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
TableCellStyle Class
Autodesk.Revit.DB Namespace